[
  {
    "title": { "text": "Greg Walker", "element": "h1" },
    "style": "paragraph",
    "items": [
      { "element": "h4", "text": "Software Engineer with 10+ years of varied experience, knowledgable about many data stores, strong documentation and collaboration/mentoring skills.  Full stack with a focus on back-end." },
      "(I'm mostly borrowing the structure of my hired.com profile here, but this will likely be the source-of-truth entry point)",
      "I'm open to any programming language, I've been happy with C# (it being the primary language for all my career so far), and it is in an exciting place in its evolution, but being tied to any technology too closely is never a great idea in my opinion.  I have worked most on building out and maintaining my general programming skills, being a technical lead for most of my time at uShip."
    ]
  },
  {
    "title": { "text": "Links", "element": "h3" },
    "style": "bullets",
    "items": [
      { "preprocess": "markdown", "text": "[Stack Overflow profile](https://stackoverflow.com/users/356218/thymine)" },
      { "preprocess": "markdown", "text": "[Work History](#work-history)" },
      { "preprocess": "markdown", "text": "[Stack Overflow Developer Story](https://stackoverflow.com/story/gregwalker) ([CV view of the same](https://stackoverflow.com/cv/gregwalker))" },
      { "preprocess": "markdown", "text": "[LinkedIn](https://www.linkedin.com/pub/greg-walker/14/314/924)" }
    ]
  },
  {
    "title": { "text": "Location", "element": "h3" },
    "style": "paragraph",
    "note": "TODO should I add in previous move histor, and family being spread out to asway concerns about concerns about relocation",
    "items": [
      "I'm in Austin, TX, and try to go to interesting meetups and conventions when possible, which there are a number of in Austin.  But I have only lived in a couple cities and would be excited to explore more and refine what qualities I really enjoy and find facinating about different cities/regions."

    ]
  },
  {
    "title": { "text": "My self-summary", "element": "h3" },
    "style": "paragraph",
    "note": "TODO reword this whole section to make it more coherant, spell check",
    "items": [
      "I'm always looking for a position that will challenge me significantly, help me grow as a developer and a person.  ",
      "Learning is one of the most important things, and a very collaborative environment is the best way I've seen to achieve that by far.  Both my own learning, and being able to help teach and mentor less experienced developers.  ",
      "I have also often enjoy the puzzle solving aspect of software development, there are very few problems I've encountered that I have not been able to find a solution for that achieves the intended goals, and often have been complimented about coming up with unique solutions that are quicker to implement than the straightforward one, whilst still being sustainable and reliable.",
      "I've noticed I derive the most pleasure from my job when I can see progress, either in a project itself, in the development of my own skills, or in the development of the skills of my fellow developers.  Move fast whilst having things setup so that breaking things is unlikely."
    ]
  },
  {
    "title": { "text": "I'm really good at", "element": "h3" },
    "noPrint": true,
    "style": "paragraph",
    "note": "TODO this seems boring, is this section needed to be displayed ever?",
    "items": [
      "Being knowledgable about the full system and realizing where things can be implemented and improved in the quickest and best ways.  Researching issues and imagining how products will be used by the customer."
    ]
  },
  {
    "title": { "text": "What I'm looking to do next", "element": "h3" },
    "style": "paragraph",
    "items": [
      "Would love to work more with Go, but .Net Core is catching up quick toward being a very nice cross-platform language that any company would be willing to adopt.  ",
      "Continue building out my skills to be a great mentor and presenter, whilst maintaining a good amount of time spent using my coding skills."
    ]
  },
  {
    "title": { "text": "Language experience", "element": "h3" },
    "style": "bullets",
    "items": [
      "High level of C#/.Net experience",
      "Good Javascript experience, along with node.js",
      "Interested in using more golang (especially professional experience using it)",
      "Good Java and Android expereince"
    ]
  },
  {
    "title": { "text": "Work History", "element": "h2" },
    "type": "work-history",
    "positions": [
      {
        "name": "uShip.com",
        "position": "Software Engineer (title: Sr Software Engineer II)",
        "location": "Austin, TX",
        "start": "Jan 2013",
        "end": "Mar 2018",
        "description": [
          "Working as Tech Lead on various teams with 5 to 10 on the teams. Mentoring and guiding other developers in good development practices has become the part of the job I enjoyed the most. Stepping back and allowing their skills to flourish and see their growth, while still making sure that the best solution is reached efficiently and preventing roadblocks.",
          "Generally working on transforming a VB.net webforms website into a React/MVC and API driven website and mobile app, with a rock solid back-end.",
          "I've primarily worked on the code surrounding the WebAPI, but tracked down bugs and dug into everything to make sure I know how it works. At uShip teams switch around a lot, so I've worked closely with the majority of developers of all skill levels here, and many of the business people.",
          "Most recently I was a large part of moving parts of our main project out to a microservice architecture. Helping design and implement the infrastructure, frameworks to support consistent logging/tracing/etc, and deployment pipeline for all future microservices."
        ]
      },
      {
        "name": "Sedona Technologies",
        "position": "Software Engineer",
        "location": "Moline, IL",
        "start": "Oct 2007",
        "end": "Dec 2012",
        "description": [
          "Responsible for leading the development efforts for one of the major software packages Sedona sold. Responsibilities include: Providing management with estimates for enhancements and new features being added to the product, provide direction to other developers on the product, and developing the design and development strategy for the product."
        ]
      }
    ]
  },
  {
    "title": { "text": "Education", "element": "h2" },
    "style": "bullets",
    "items": [
      "Iowa State University",
      "B.S. Computer Science",
      "2007"
    ]
  },
  {
    "title": { "text": "Recommendations", "element": "h3" },
    "style": "paragraph",
    "items": [
      { "preprocess": "markdown", "text": "[Link](recommendations)" }
    ]
  }
]
